const moment = require('moment')

const club = [ 1009, 1010, 1011, 1012, 1013, 1014, 1015, 1016 ]

//1-무진, 2-승성, 3-쇼부, 4-호랑이, 7-유로, 13-구일, 14-베르누이, 15-esc
const teamIds = [1, 2, 3, 4, 7, 13, 14, 15]

const totalMatchDay = '28일'

const seqMatches = [
  [ 1016, 1015 ],
  [ 1011, 1013 ],
  [ 1012, 1009 ],
  [ 1010, 1014 ],
  [ 1009, 1011 ],
  [ 1016, 1013 ],
  [ 1015, 1014 ],
  [ 1010, 1012 ],
  [ 1013, 1014 ],
  [ 1012, 1015 ],
  [ 1010, 1009 ],
  [ 1016, 1011 ],
  [ 1012, 1013 ],
  [ 1014, 1011 ],
  [ 1010, 1015 ],
  [ 1016, 1009 ],
  [ 1009, 1014 ],
  [ 1010, 1011 ],
  [ 1016, 1012 ],
  [ 1015, 1013 ],
  [ 1012, 1011 ],
  [ 1010, 1013 ],
  [ 1014, 1016 ],
  [ 1009, 1015 ],
  [ 1009, 1013 ],
  [ 1016, 1010 ],
  [ 1015, 1011 ],
  [ 1012, 1014 ],
  [ 1013, 1011 ],
  [ 1014, 1010 ],
  [ 1009, 1012 ],
  [ 1015, 1016 ],
  [ 1015, 1010 ],
  [ 1009, 1016 ],
  [ 1013, 1012 ],
  [ 1011, 1014 ],
  [ 1016, 1014 ],
  [ 1011, 1012 ],
  [ 1015, 1009 ],
  [ 1013, 1010 ],
  [ 1013, 1016 ],
  [ 1014, 1015 ],
  [ 1012, 1010 ],
  [ 1011, 1009 ],
  [ 1014, 1013 ],
  [ 1009, 1010 ],
  [ 1011, 1016 ],
  [ 1015, 1012 ],
  [ 1014, 1009 ],
  [ 1013, 1015 ],
  [ 1011, 1010 ],
  [ 1012, 1016 ],
  [ 1010, 1016 ],
  [ 1014, 1012 ],
  [ 1011, 1015 ],
  [ 1013, 1009 ]
]

const ableDays = [
  '2017-03-04',
  '2017-03-11',
  '2017-03-18',
  '2017-03-25',
  '2017-04-01',
  '2017-04-08',
  '2017-04-15',
  '2017-04-22',
  '2017-04-29',
  '2017-05-13',
  '2017-05-20',
  '2017-05-27',
  '2017-06-10',
  '2017-06-17',
  '2017-06-24',
  '2017-07-01',
  '2017-07-08',
  '2017-07-15',
  '2017-08-19',
  '2017-08-26',
  '2017-09-02',
  '2017-09-09',
  '2017-09-16',
  '2017-09-23',
  '2017-09-30',
  '2017-10-14',
  '2017-10-21',
  '2017-10-28'
]

const insertClub = temaIds => {
  return temaIds.map(teamId => {
    return `insert into club (teamId, formation, leagueId) values (${teamId}, '4-3-3', 2)`
  })
}

const insertMatch = seqMatches => {
  let k = 0
  return seqMatches.map((matchTeam, index) => {

    let kickoffTime = null

    if (!(index % 2)) {
      kickoffTime = moment(ableDays[k]).hours(19).format('YYYY-MM-DD HH:mm:ss')
    }else {
      kickoffTime = moment(ableDays[k]).hours(21).format('YYYY-MM-DD HH:mm:ss')
      k++ // next matchday
    }

    return `insert into \`match\` (matchName, homeClubId, awayClubId, kickoffTime, leagueId) values (${index + 1}, ${matchTeam[0]}, ${matchTeam[1]}, ${kickoffTime}, 2)`
  })
}

// console.log("insertMatch  : ", insertMatch(seqMatches))